app/views/admin/generals/_form.html.erb

        <%= f.label :contest_archive_id, 'Archiwum' %>
        <%= f.select :contest_archive_id, ContestArchive.all.map{|archive| [archive.title, archive.id] },:include_blank => true %>
---
SELECT "contest_archives".* FROM "contest_archives"

      <%= f.label :marker_id, 'Centrum Mapy' %>
      <%= f.select :marker_id, Marker.all.map{|marker| [marker.desc, marker.id] },:include_blank => true %>
---
SELECT "markers".* FROM "markers"