app/views/admin/contest_archives/edit.html.erb

		  <tbody class="ordering-container" >
		    <% @contest_archive.contest_records.order(id: :desc).each_with_index do |record, idx| %>
---
SELECT "contest_records".* FROM "contest_records" WHERE "contest_records"."contest_archive_id" = $1  ORDER BY "contest_records"."id" ASC  [["contest_archive_id", 55]]