app/controllers/admin/contest_archives_controller.rb

SELECT "contest_archives".* FROM "contest_archives"
---
  def index
    @contest_archives = ContestArchive.all

INSERT INTO "contest_archives" ("title", "titlePL", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Archiwum"], ["titlePL", "Archiwum"], ["created_at", "2015-12-15 14:20:36.340153"], ["updated_at", "2015-12-15 14:20:36.340153"]]
---
  def create
    @contest_archive = ContestArchive.new(contest_archive_params)

    respond_to do |format|
      if @contest_archive.save

SELECT  "contest_archives".* FROM "contest_archives" WHERE "contest_archives"."id" = $1 LIMIT 1  [["id", 55]]
---
    def set_contest_archive
      @contest_archive = ContestArchive.find(params[:id])