app/controllers/admin/contest_records_controller.rb

    def set_contest_record
      @contest_record = ContestRecord.find(params[:id])
---
SELECT  "contest_records".* FROM "contest_records" WHERE "contest_records"."id" = $1 LIMIT 1  [["id", 2024]]