app/controllers/admin/generals_controller.rb

UPDATE "generals" SET "contest_archive_id" = $1, "updated_at" = $2 WHERE "generals"."id" = $3  [["contest_archive_id", nil], ["updated_at", "2015-12-15 14:19:11.904154"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @general.update(general_params)

SELECT  "generals".* FROM "generals" WHERE "generals"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_general
      @general = General.find(params[:id])