app/controllers/admin/registrations_controller.rb

  def index
    @registrations = Registration.all
---
SELECT "registrations".* FROM "registrations"

  def archive
    archive = ContestArchive.find(params[:archive_id])
    params[:record_ids].each do |id|
      registration = Registration.find(id)
      @record = archive.contest_records.build
      @record.title = registration.first_name + ' ' + registration.last_name
      @record.serial = registration.serial
      registration.images.each do |image|
        public_image = @record.public_images.build
        public_image.src = File.new( image.src.to_s )
      end
    end
    archive.save
---
SELECT  "contest_archives".* FROM "contest_archives" WHERE "contest_archives"."id" = $1 LIMIT 1  [["id", 55]]
SELECT  "registrations".* FROM "registrations" WHERE "registrations"."id" = $1 LIMIT 1  [["id", 844]]
SELECT "images".* FROM "images" WHERE "images"."registration_id" = $1  [["registration_id", 844]]
INSERT INTO "contest_records" ("contest_archive_id", "title", "serial", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["contest_archive_id", 55], ["title", "marcin kusior"], ["serial", "459LP"], ["created_at", "2015-12-15 14:20:43.736292"], ["updated_at", "2015-12-15 14:20:43.736292"]]