app/views/admin/contest_records/_form.html.erb

      <% if params[:contest_archive_id].present? %>
        <%= f.select :contest_archive_id, ContestArchive.all.map{|archive| [archive.title, archive.id] }, :selected => params[:contest_archive_id] %>
---
SELECT "contest_archives".* FROM "contest_archives"


        <% @contest_record.public_images.each do |image| %>
---
SELECT "public_images".* FROM "public_images" WHERE "public_images"."contest_record_id" = $1  [["contest_record_id", 2024]]