app/views/admin/registrations/index.html.erb

SELECT "contest_archives".* FROM "contest_archives"
---
   <%= submit_tag("Archiwizuj Zaznaczone", data: { confirm: warning, disable_with: 'Proszę czekać' } ) %>
   <%= select_tag(:archive_id,  options_from_collection_for_select(ContestArchive.all, "id", "title")) %>