app/controllers/pages_controller.rb

	def Contest
		gallery_archive_id = General.first.contest_archive_id
		@archives = ContestArchive.where.not(id: gallery_archive_id).order(order: :asc)
		@gallery_archive = ContestArchive.find(gallery_archive_id) unless gallery_archive_id.blank?
		@gallery_archive_ids = @gallery_archive.contest_records.map{|record| record.id} unless gallery_archive_id.blank?

		@registration = Registration.new
		3.times { @registration.images.build }

		# gathering results
		total = Vote.all.length.to_f
---
SELECT  "generals".* FROM "generals"  ORDER BY "generals"."id" ASC LIMIT 1
SELECT  "contest_archives".* FROM "contest_archives" WHERE "contest_archives"."id" = $1 LIMIT 1  [["id", 54]]
SELECT "votes".* FROM "votes"

	def Contact
		@newsaddresse = Newsaddresse.new
		@center = Marker.find( General.first.marker_id )
		@zoom = General.first.map_zoom
---
SELECT  "markers".* FROM "markers" WHERE "markers"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "generals".* FROM "generals"  ORDER BY "generals"."id" ASC LIMIT 1
SELECT "markers".* FROM "markers"

	def find_page
		@page = Page.find_by slug: action_name
---
SELECT  "pages".* FROM "pages" WHERE "pages"."slug" = $1 LIMIT 1  [["slug", "Biennial"]]