app/controllers/registrations_controller.rb

INSERT INTO "registrations" ("first_name", "last_name", "telephone", "street", "city", "zip_code", "country", "university", "supervising_professor", "email", "terms_of_service", "serial", "group_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create
  	@registration = Registration.new(registration_params)

    respond_to do |format|
      if @registration.save