app/views/layouts/_main_nav.html.erb

			<ul class="nav navbar-nav navbar-right">
				<% Page.order(:order).where.not(order: nil).each do |page| %>
---
SELECT "pages".* FROM "pages" WHERE ("pages"."order" IS NOT NULL)  ORDER BY "pages"."order" ASC