app/views/layouts/_partners.html.erb

	function evenOut(){
		$('.partners-parent').children().each( function(idx, partner){
			$(partner).css('width', '25%' );
			if( idx != 0 && idx % 6 == 0 ){ $(partner).css('margin-right', '0.1px') }

		} )
---
SELECT "partners".* FROM "partners"