app/views/layouts/_program.html.erb

			<div class="row table-row">
				<% Event.all.order(:order).each do |event| %>
---
SELECT "events".* FROM "events"  ORDER BY "events"."order" ASC